dakota_openfoam_cases/naca_shape/multidim/casebase/0/tur/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.24;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.24;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.24;
        value           uniform 0.24;
    }
    ground
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }
    sides
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    ahmed_OpenSCAD_Model
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }
}

// ************************************************************************* //
